sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/config/toolbox_resources/DA1453x/common/DA14535.xml
	<registers>
	<register>
	<name>GP_DATA_REG</name>
	
	<addressOffset>0x00000024</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>P03_P04_FILT_DIS</name>
	<description>0: RC filtered input enabled for P0_3 and P0_4 (for example, when used for wake-up)
1: RC filtered input disabled for P0_3 and P0_4 (for example, when used for external clk or XTAL32k)</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FORCE_RCX_VDD</name>
	<description>0: RCX bias supply open (see FORCE_RCX_VREF)
1: RCX bias supply connected to VDD (use for sleep)</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FORCE_RCX_VREF</name>
	<description>0: RCX bias supply connected to clamp and VDD via 400k resistor (old situation)
1: RCX bias supply connected to vref_0v75_0 (use for calibration)</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DISABLE_CLAMP_OVERRULE</name>
	
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SW_GP_DATA</name>
	
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>HIBERN_CTRL_REG</name>
	<description>Hibernation control register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>HIBERN_WKUP_MASK</name>
	<description>Selects which pin to wake up from</description>
	<bitRange>[6:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>HIBERN_WKUP_POLARITY</name>
	<description>Selects the polarity of the wake-up source. The polarity must be chosen such that the ANA_STATUS_REG[CLKLESS_WAKEUP_STAT] is 1. Any change on the selected GPIOs will make the CLKLESS_WAKEUP_STAT go to 0, and wake up the system from hibernation.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>HIBERNATION_ENABLE</name>
	<description>Enables the hibernation mode when sleeping
0: deep sleep mode, PD_SLP remains on
1: hibernation mode, PD_SLP goes off. REMAP_ADR0 needs to be set to the correct source to boot from before going to sleep.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>HWR_CTRL_REG</name>
	<description>Hardware Reset control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>DISABLE_HWR</name>
	<description>Disables the RST functionality on P00</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PAD_LATCH_REG</name>
	<description>Control the state retention of the GPIO ports</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>PAD_LATCH_EN</name>
	<description>Controls the state retention of the pads.
0: latches are closed, pads retain their state.
1: latches are open, new control values have immediate effect</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>POWER_AON_CTRL_REG</name>
	
	<addressOffset>0x00000020</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000008</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields><field>
	<name>FORCE_RUNNING_COMP_DIS</name>
	
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_RET_TRIM</name>
	<description>VDD clamp level setting for hibernation mode</description>
	<bitRange>[13:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMP_VCONT_SLP_DISABLE</name>
	<description>Disable vcont comparator in SLP</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOOST_MODE_FORCE</name>
	<description>0x:automatic selection of boost mode
11: force boost mode
10: force buck mode</description>
	<bitRange>[8:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CHARGE_VBAT_DISABLE</name>
	<description>Do not charge vbat high in boost mode</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RC32K_LOW_SPEED_FORCE</name>
	
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RC32K_HIGH_SPEED_FORCE</name>
	
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>POR_VBAT_HIGH_RST_MASK</name>
	<description>Mask rst from por_vbat_high</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>POR_VBAT_LOW_RST_MASK</name>
	<description>Mask rst from por_vbat_low</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VBAT_HL_CONNECT_RES_CTRL</name>
	<description>00: OFF
01: Forced ON
10: Active: automatic control, Sleep: forced ON
11: Automatic control</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PULL_HW_BYPASS_REG</name>
	<description>Control the muxes for P0_1 pull up and down</description>
	<addressOffset>0x00000014</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>PULL_HW_BYPASS</name>
	<description>0 : Normal operation
1 : Force pull up registor at GPIO P0_1 in boost mode</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RAM_LPMX_REG</name>
	
