sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/config/toolbox_resources/DA1453x/common/DA14535.xml
	<addressOffset>0x00000036</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>XTALRDY_STAT</name>
	
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>DCDC</name>
	<version>1.0</version>
	<description>DCDC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50000080</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>12</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>DCDC_CTRL1_REG</name>
	
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000003f</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>DCDC_LEVEL1V1_BUMP</name>
	<description>Increases the DCDC output voltage in BUCK mode (DCDC_LEVEL = 00) from 1.1 V to 1.2 V</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_FIX_ILIM_SLP</name>
	<description>Sets a fixed inductor current limit in sleep to maximize amount of charge added per cycle and minimize the duty-cycle.
0x0: Automatic current limit setting remains active in sleep-mode
0x1: Current limit fixed in sleep-mode, value set with field DCDC_ILIM_SLP</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_ILIM_SLP</name>
	<description>Maximum value for the fixed inductor current in sleep-mode:
0x0: 6 mA
0x1: 12 mA
0x2: 18 mA
0x3: 24 mA
0x4: 30 mA
0x5: 36 mA
0x6: 42 mA
0x7: 48 mA
0x8: 54 mA
0x9: 60 mA
0xA: 66 mA
0xB: 72 mA
0xC: 78 mA
0xD: 84 mA
0xE: 90 mA
0xF: 96 mA (default, lowest duty-cycle)</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCDC_CTRL_REG</name>
	
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000084a2</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DCDC_ILIM_MAX</name>
	<description>Maximum value for automatic inductor peak current limit control.
0x0: 6 mA
0x1: 12 mA
0x2: 18 mA
0x3: 24 mA
0x4: 30 mA
0x5: 36 mA
0x6: 42 mA
0x7: 48 mA
0x8: 54 mA (default, limits inrush current)
0x9: 60 mA
0xA: 66 mA
0xB: 72 mA
0xC: 78 mA
0xD: 84 mA
0xE: 90 mA
0xF: 96 mA (set as default for low-ohmic batteries)</description>
	<bitRange>[15:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_ILIM_MIN</name>
	<description>Minimum value for automatic inductor peak current limit control.
0x0: 6 mA
0x1: 12 mA
0x2: 18 mA
0x3: 24 mA
0x4: 30 mA (default)
0x5: 36 mA
0x6: 42 mA
0x7: 48 mA
0x8: 54 mA
0x9: 60 mA
0xA: 66 mA
0xB: 72 mA
0xC: 78 mA
0xD: 84 mA
0xE: 90 mA
0xF: 96 mA</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_OK_CLR_CNT</name>
	<description>Number of subsequent V_NOK events needed to reset VDCD_OK.
0x0: 2
0x1: 4
0x2: 8 (deafult)
0x3: 15</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_TIMEOUT</name>
	<description>Switch timeout, go to next state if either switch is active for longer than this setting.
0x0: Disabled
0x1: 0.25 us
0x2: 0.50 us
0x3: 0.75 us
0x4: 1.00 us (default)
0x5: 1.25 us
0x6: 1.50 us
0x7: 1.75 us</description>
	<bitRange>[5:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_CLK_DIV</name>
	<description>Idle clock divider, sets rate at which the output is monitored when the converter is idle.
0x0: Divide by 4
0x1: Divide by 8
0x2: Divide by 16
0x3: Divide by 32</description>
	<bitRange>[2:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_ENABLE</name>
	<description>Enables hardware control of the DCDC converter.
0: DCDC converter disabled
1: DCDC converter under hardware control</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCDC_STATUS1_REG</name>
	
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000048</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DCDC_FSM_STATE</name>
	
	<bitRange>[15:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_SW_STATE</name>
	
	<bitRange>[11:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_VOUT_NOK</name>
	
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_VOUT_OK</name>
	
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_ILIM</name>
	
	<bitRange>[7:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_BOOST_MODE</name>
	
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_STARTUP_COMPLETE</name>
	
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_ENABLED</name>
	
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_VDCDC_OK</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>DCDC_STATUS2_REG</name>
	
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>DCDC_COMP_TRIM</name>
	
	<bitRange>[13:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_TIMEOUT_PSW</name>
	
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_TIMEOUT_NSW</name>
	
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_COMP_P_DYN_P</name>
	
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_COMP_P_DYN_N</name>
	
