sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/config/toolbox_resources/DA1453x/common/DA14535.xml
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_COMP_P_CONT</name>
	
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_COMP_N_DYN_P</name>
	
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_COMP_N_DYN_N</name>
	
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_COMP_N_CONT</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>DCDC_TEST1_REG</name>
	
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000400</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields><field>
	<name>DCDC_DIG_TST_SEL</name>
	
	<bitRange>[14:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_ILIM_VAL</name>
	
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_COMP_CLK_VAL</name>
	
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_FORCE_ILIM</name>
	
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_FORCE_COMP_TRIM</name>
	
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_FORCE_COMP_CLK</name>
	
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_SW_TST</name>
	
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_FORCE_TRIG</name>
	
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_FORCE_IDLE</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCDC_TEST2_REG</name>
	
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>DCDC_COMP_TRIM_VAL</name>
	
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>DEM</name>
	<version>1.0</version>
	<description>DEM registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x40002000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>112</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>RF_AFC_CTRL_REG</name>
	
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000015</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>AFC_SYNCF_DIRECT</name>
	
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>APD_MODE</name>
	
	<bitRange>[8:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PAD_MODE</name>
	
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AFC_MODE</name>
	
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_AGC_CTRL1_REG</name>
	
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0056d50d</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>AGC_MODE</name>
	
	<bitRange>[22:21]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AGC_TH2_HIGH</name>
	
	<bitRange>[20:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AGC_TH_HIGH</name>
	
	<bitRange>[13:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AGC_TH_LOW</name>
	
	<bitRange>[6:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_AGC_CTRL2_REG</name>
	
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0040148d</resetValue>
	<resetMask>0x007fffff</resetMask>
	<fields><field>
	<name>EN_FRZ_GAIN</name>
	
	<bitRange>[22:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AGCSETTING_WR</name>
	
	<bitRange>[21:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AGCSETTING_SEL</name>
	
	<bitRange>[17:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AGC_MAX_SETTING</name>
	
	<bitRange>[12:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AGCDEC_WAIT</name>
	
	<bitRange>[8:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AGCINC_WAIT</name>
	
	<bitRange>[6:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FASTAGC_WAIT</name>
	
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FASTAGC_STEPS</name>
	
	<bitRange>[2:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FASTAGC_EN</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_AGC_LUT_0123_REG</name>
	
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x23030201</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LNA_GAIN3</name>
	
	<bitRange>[31:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN3</name>
	
	<bitRange>[28:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN3</name>
	
	<bitRange>[25:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_GAIN2</name>
	
	<bitRange>[23:21]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN2</name>
	
	<bitRange>[20:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN2</name>
	
	<bitRange>[17:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_GAIN1</name>
	
	<bitRange>[15:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN1</name>
	
	<bitRange>[12:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN1</name>
	
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_GAIN0</name>
	
