sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/config/toolbox_resources/DA1453x/common/DA14535.xml
	<bitRange>[7:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN0</name>
	
	<bitRange>[4:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN0</name>
	
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_AGC_LUT_4567_REG</name>
	
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x332f2b27</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LNA_GAIN7</name>
	
	<bitRange>[31:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN7</name>
	
	<bitRange>[28:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN7</name>
	
	<bitRange>[25:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_GAIN6</name>
	
	<bitRange>[23:21]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN6</name>
	
	<bitRange>[20:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN6</name>
	
	<bitRange>[17:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_GAIN5</name>
	
	<bitRange>[15:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN5</name>
	
	<bitRange>[12:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN5</name>
	
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_GAIN4</name>
	
	<bitRange>[7:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN4</name>
	
	<bitRange>[4:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN4</name>
	
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_AGC_LUT_89AB_REG</name>
	
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x77775737</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LNA_GAIN11</name>
	
	<bitRange>[31:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN11</name>
	
	<bitRange>[28:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN11</name>
	
	<bitRange>[25:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_GAIN10</name>
	
	<bitRange>[23:21]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN10</name>
	
	<bitRange>[20:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN10</name>
	
	<bitRange>[17:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_GAIN9</name>
	
	<bitRange>[15:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN9</name>
	
	<bitRange>[12:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN9</name>
	
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_GAIN8</name>
	
	<bitRange>[7:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN8</name>
	
	<bitRange>[4:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN8</name>
	
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_AGC_LUT_CDEF_REG</name>
	
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x01022243</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LNA_GAIN15</name>
	
	<bitRange>[31:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN15</name>
	
	<bitRange>[28:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN15</name>
	
	<bitRange>[25:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_GAIN14</name>
	
	<bitRange>[23:21]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN14</name>
	
	<bitRange>[20:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN14</name>
	
	<bitRange>[17:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_GAIN13</name>
	
	<bitRange>[15:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN13</name>
	
	<bitRange>[12:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN13</name>
	
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_GAIN12</name>
	
	<bitRange>[7:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN12</name>
	
	<bitRange>[4:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN12</name>
	
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_AGC_RESULT_REG</name>
	
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>AGCSETTING_RD</name>
	
	<bitRange>[11:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>AFC_RD</name>
	
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_DC_OFFSET_CTRL1_REG</name>
	
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00020100</resetValue>
	<resetMask>0x0003fdfe</resetMask>
	<fields><field>
	<name>DCOFFSET_Q_WR</name>
	
	<bitRange>[17:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOFFSET_I_WR</name>
	
	<bitRange>[8:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_DC_OFFSET_CTRL2_REG</name>
	
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00f86696</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>DCOC_RESULT_LNAGAIN345_LUT</name>
	
	<bitRange>[23:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOC_RESULT_LNAGAIN2_LUT</name>
	
	<bitRange>[21:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOC_RESULT_LNAGAIN1_LUT</name>
	
	<bitRange>[19:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOC_RESULT_LNAGAIN0_LUT</name>
	
	<bitRange>[17:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCPAR_DCF_EN</name>
	
