sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/config/toolbox_resources/DA1453x/common/DA14535.xml
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCPAR_MULT_STEPS_EN</name>
	
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCPARNGAIN</name>
	
	<bitRange>[13:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCVGA1SCALE_EN</name>
	
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCPARCAL_INIT</name>
	
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCFULLNGAIN</name>
	
	<bitRange>[7:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCNSTEP</name>
	
	<bitRange>[4:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCPARCAL_EN</name>
	
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOFFSET_SEL</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_DC_OFFSET_CTRL3_REG</name>
	
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000dce4</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DCBETA_Q</name>
	
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCBETA_I</name>
	
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_DC_OFFSET_CTRL4_REG</name>
	
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00009210</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DCAGCSETTING_FULL3</name>
	
	<bitRange>[15:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCAGCSETTING_FULL2</name>
	
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCAGCSETTING_FULL1</name>
	
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCAGCSETTING_FULL0</name>
	
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_DC_OFFSET_FULL_RES_REG</name>
	
	<addressOffset>0x0000005c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>DCOFFSET_Q_RD</name>
	
	<bitRange>[17:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCOFFSET_I_RD</name>
	
	<bitRange>[8:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_DC_OFFSET_MPAR_RES0_REG</name>
	
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>DCOFFSET_Q_RD</name>
	
	<bitRange>[17:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCOFFSET_I_RD</name>
	
	<bitRange>[8:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_DC_OFFSET_MPAR_RES1_REG</name>
	
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>DCOFFSET_Q_RD</name>
	
	<bitRange>[17:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCOFFSET_I_RD</name>
	
	<bitRange>[8:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_DC_OFFSET_MPAR_RES2_REG</name>
	
	<addressOffset>0x00000068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>DCOFFSET_Q_RD</name>
	
	<bitRange>[17:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCOFFSET_I_RD</name>
	
	<bitRange>[8:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_DC_OFFSET_MPAR_RES3_REG</name>
	
	<addressOffset>0x0000006c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>DCOFFSET_Q_RD</name>
	
	<bitRange>[17:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCOFFSET_I_RD</name>
	
	<bitRange>[8:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_DC_OFFSET_RESULT_REG</name>
	
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>DCOFFSET_Q_RD</name>
	
	<bitRange>[17:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCOFFSET_I_RD</name>
	
	<bitRange>[8:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_DEM_ATTR_REG</name>
	
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00c4a18f</resetValue>
	<resetMask>0xffdfffff</resetMask>
	<fields><field>
	<name>ADDR_TIMEOUT_X2</name>
	
	<bitRange>[24:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RFADC_CLK_PHASE</name>
	
	<bitRange>[23:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RSSI_TH</name>
	
	<bitRange>[20:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCPOLE</name>
	
	<bitRange>[14:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOC_SPEED8M_EN</name>
	
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AGC_SPEED8M_EN</name>
	
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MATCH0101_TH</name>
	
	<bitRange>[9:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEM_HSI_POL</name>
	
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RXDATA_INV</name>
	
