sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/config/toolbox_resources/DA1453x/common/DA14535.xml
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AFC_POLE2</name>
	
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AFC_POLE1</name>
	
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_DEM_CTRL_REG</name>
	
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000003</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>IQ_TO_GPIO_EN</name>
	
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AGC_USE_GPIO_IN</name>
	
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IQCORR_EN</name>
	
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BLE_DDC_EN</name>
	
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EQUAL_EN</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_DEM_IQCORRECT_REG</name>
	
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>IQCORR_ALPHA</name>
	
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IQCORR_BETA</name>
	
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_DEM_TESTMODE_REG</name>
	
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>DEM_RFMON_TRIGGER</name>
	
	<bitRange>[8:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEM_GPADC_MUX_SEL</name>
	
	<bitRange>[6:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEM_RFMON_SOURCE</name>
	
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_PAD_CNT_CTRL_REG</name>
	
	<addressOffset>0x0000004c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00004000</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields><field>
	<name>PAD_CLEAR_COUNT</name>
	
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PAD_NEG_LIMIT</name>
	
	<bitRange>[13:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PAD_POS_LIMIT</name>
	
	<bitRange>[6:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_PAD_CNT_RESULT_REG</name>
	
	<addressOffset>0x00000050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PAD_NEG_CNT_RD</name>
	
	<bitRange>[15:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PAD_POS_CNT_RD</name>
	
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_RSSI_COMP_CTRL_REG</name>
	
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00088888</resetValue>
	<resetMask>0x000fffff</resetMask>
	<fields><field>
	<name>RSSI_COMP4</name>
	
	<bitRange>[19:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RSSI_COMP3</name>
	
	<bitRange>[15:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RSSI_COMP2</name>
	
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RSSI_COMP1</name>
	
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RSSI_COMP0</name>
	
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_RSSI_RESULT_REG</name>
	
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000fffff</resetMask>
	<fields><field>
	<name>RSSI_AVG_RD</name>
	
	<bitRange>[19:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RSSI_LATCHED_RD</name>
	
	<bitRange>[9:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>dig</name>
	<version>1.0</version>
	<description>dig registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x40003000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>152</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>ADPLL_ACC_CTRL_REG</name>
	
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x8bf40bf4</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>EN_CMF_AVG</name>
	
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CLIP_MOD_TUNE_0_TX</name>
	
	<bitRange>[28:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CLIP_MOD_TUNE_0_RX</name>
	
	<bitRange>[12:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_ANATST_CTRL_REG</name>
	
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>ANATSTSPARE</name>
	
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ANATSTEN</name>
	
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_ANATST_RD_REG</name>
	
	<addressOffset>0x00000094</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>ANATSTSPARE_IN</name>
	
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>ADPLL_ANA_CTRL_REG</name>
	
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0215807b</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>RXDIV_LKGFIX_DIS</name>
	
