sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/config/toolbox_resources/DA1453x/common/DA14535.xml
	<bitRange>[29:29]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>QUALMONDET</name>
	
	<bitRange>[26:26]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TDCBUB</name>
	
	<bitRange>[25:25]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PHVSA0</name>
	
	<bitRange>[24:24]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PHVSA1</name>
	
	<bitRange>[23:23]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FREQDIFF</name>
	
	<bitRange>[22:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>ADPLL_FSM_CTRL_REG</name>
	
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x08f8ae84</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TVPASETTLE</name>
	
	<bitRange>[29:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TSETTLE</name>
	
	<bitRange>[23:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TPASETTLE</name>
	
	<bitRange>[19:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TMOD</name>
	
	<bitRange>[15:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TFINE</name>
	
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TMEDIUM</name>
	
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TCOARSE</name>
	
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_INIT_CTRL_REG</name>
	
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000005</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>DCOMODIC</name>
	
	<bitRange>[28:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOFINEIC</name>
	
	<bitRange>[13:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOMEDIUMIC</name>
	
	<bitRange>[6:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOCOARSEIC</name>
	
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_KDCO_CAL_CTRL1_REG</name>
	
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00009b9b</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>KDCOLF_IN_1M</name>
	
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDCOHFIC_1M</name>
	
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_KDCO_CAL_CTRL2_REG</name>
	
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x4c14000a</resetValue>
	<resetMask>0xffff00ff</resetMask>
	<fields><field>
	<name>KDCOESTDEV</name>
	
	<bitRange>[31:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDCOCALTX</name>
	
	<bitRange>[29:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDCOCALRX</name>
	
	<bitRange>[28:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDCOLFCALEN</name>
	
	<bitRange>[27:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TKDCOCAL</name>
	
	<bitRange>[26:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDCOCN_IC</name>
	
	<bitRange>[22:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KMOD_ALPHA_1M</name>
	
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_KDCO_RD_REG</name>
	
	<addressOffset>0x00000084</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>CAL_KDCOCAL</name>
	
	<bitRange>[23:23]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>KDCOCN</name>
	
	<bitRange>[22:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>KDCO_HF_OUT</name>
	
	<bitRange>[15:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>KDCO_HF_INT</name>
	
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>ADPLL_KDTCTDC_CAL_CTRL1_REG</name>
	
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x8514429c</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>KDTCIC</name>
	
	<bitRange>[31:23]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDTCCN_IC</name>
	
	<bitRange>[22:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDTC_PIPELINE_BYPASS</name>
	
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KTDC_IN</name>
	
	<bitRange>[14:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDTC_ALPHA</name>
	
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_KDTCTDC_CAL_CTRL2_REG</name>
	
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00007f50</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PHRDLY_EXTRA</name>
	
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TKDTCCAL</name>
	
	<bitRange>[14:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHRDLY</name>
	
	<bitRange>[10:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KTDCCALEN</name>
	
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDTCCALLG</name>
	
	<bitRange>[6:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDTCCAL_INV</name>
	
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDTCCALMOD1P</name>
	
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDTCCALMOD</name>
	
