sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/config/toolbox_resources/DA1453x/common/DA14535.xml
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDTCCALEN</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_KDTC_RD_REG</name>
	
	<addressOffset>0x00000088</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x03ffffff</resetMask>
	<fields><field>
	<name>CAL_KDTCCAL</name>
	
	<bitRange>[25:25]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>KDTC_ALPHA_COMP</name>
	
	<bitRange>[24:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>KDTCCN</name>
	
	<bitRange>[15:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>KDTC_OUT</name>
	
	<bitRange>[8:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>ADPLL_LF_CTRL1_REG</name>
	
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000818c</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>FINEKZ</name>
	
	<bitRange>[15:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FINEK</name>
	
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FINETAU</name>
	
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_LF_CTRL2_REG</name>
	
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x1ca2879e</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>RST_TAU_EN</name>
	
	<bitRange>[30:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MODKZ</name>
	
	<bitRange>[29:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MODK</name>
	
	<bitRange>[23:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MODTAU</name>
	
	<bitRange>[17:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MODK_TUNE</name>
	
	<bitRange>[11:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MODTAU_TUNE</name>
	
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_MISC_CTRL_REG</name>
	
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000000da</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>PHR_FRAC_PRESET_VAL</name>
	
	<bitRange>[23:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ENFCWMOD</name>
	
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ENRESIDUE</name>
	
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MODDLY</name>
	
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RESDLY</name>
	
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DLYFCWDT</name>
	
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_MON_CTRL_REG</name>
	
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00fc0f83</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>QUALMONFRCEN</name>
	
	<bitRange>[30:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QUALMONTRHLD</name>
	
	<bitRange>[29:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QUALMONWND</name>
	
	<bitRange>[23:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QUALMONMOD</name>
	
	<bitRange>[17:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>HOLD_STATE</name>
	
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RFMEAS_MODE</name>
	
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ENRFMEAS</name>
	
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TMREN</name>
	
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TFREQMEAS</name>
	
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_OVERRULE_CTRL1_REG</name>
	
	<addressOffset>0x00000050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>OVR_DTC_OH_WR</name>
	
	<bitRange>[31:25]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_DTC_OH_SEL</name>
	
	<bitRange>[24:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_DCOAMP_WR</name>
	
	<bitRange>[20:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_DCOAMP_SEL</name>
	
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_DCOAMPHOLD_WR</name>
	
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_DCOAMPHOLD_SEL</name>
	
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_RDYFORDIV_WR</name>
	
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_RDYFORDIV_SEL</name>
	
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_VPAEN_WR</name>
	
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_VPAEN_SEL</name>
	
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_SRESETN_WR</name>
	
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_SRESETN_SEL</name>
	
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_ENPAIN_WR</name>
	
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_ENPAIN_SEL</name>
	
