sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/config/toolbox_resources/DA1453x/common/DA14535.xml
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPIKE_FLT_DISABLE</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_TESTCTRL1_REG</name>
	
	<addressOffset>0x0000003a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RFCLK_SEL_ADPLL_ADC_TO_GPIO</name>
	
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RFCLK_ADC_TO_GPIO</name>
	
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RFCLK_ADPLL_TO_GPIO</name>
	
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PROG_VREF_SEL</name>
	
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VARICAP_TEST_SEL_XTAL</name>
	
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VARICAP_TEST_ENABLE</name>
	
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_VREF_HOLD_OVERRIDE</name>
	
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DISABLE_TM_CLK</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>GPREG</name>
	<version>1.0</version>
	<description>GPREG registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50003300</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>14</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>BLE_TIMER_REG</name>
	<description>BLE FINECNT sampled value while in deep sleep state.</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>BLE_TIMER_DATA</name>
	<description>Operation depends on GP_CONTROL_REG-&gt;BLE_TIMER_DATA_CTRL.
If BLE_TIMER_DATA_CTRL = 0 then:
This register is located at the Always On Power Domain and it holds the automatically sampled value of the BLE FINECNT timer
The HW automatically samples the value into this register during the sequence of &quot;BLE Sleep On&quot; and restores automatically the value during the BLE Wake up sequence.
The Software may read and modify the value while the BLE is in Sleep state. While the BLE is awake, the value of the register has no meaning, while changing the value by writing another one will have no effect in the operation of the BLE core.
There is a constraint when the SW performs an write-read sequence where it has to inject a one cycle delay in between (for example, write-NOP-read) in order to read back the correct value.
If BLE_TIMER_DATA_CTRL is non 0 then write operations have the same effect as when BLE_TIMER_DATA_CTRL=0, while for read operations:
BLE_TIMER_DATA_CTRL= 1: then reading BLE_TIMER_REG returns &quot;deepsldur[9:0]&quot;.
BLE_TIMER_DATA_CTRL= 2: then reading BLE_TIMER_REG returns &quot;deepsltime_samp[9:0]&quot;.
BLE_TIMER_DATA_CTRL= 3: then reading BLE_TIMER_REG returns &quot;{deep_sleep_stat_monitor, deepsltime_samp[18:10]}.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DEBUG_REG</name>
	<description>Various debug information register.</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DEBUGS_FREEZE_EN</name>
	<description>Default 1, freezing of the on-chip timers is enabled when the Cortex is halted in DEBUG State.
If 0, freezing of the on-chip timers is depending on FREEZE_REG when the Cortex is halted in DEBUG State except the watchdog timer. The watchdog timer is always frozen when the Cortex is halted in DEBUG State. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>GP_CONTROL_REG</name>
	<description>General purpose system control register.</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>BLE_TIMER_DATA_CTRL</name>
	<description>Refer to BLE_TIMER_REG.</description>
	<bitRange>[6:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CPU_DMA_BUS_PRIO</name>
	<description>Controls the CPU DMA system bus priority:
If 0, the CPU has highest priority.
If 1, the DMA has highest priority.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BLE_WAKEUP_LP_IRQ</name>
	<description>The current value of the BLE_WAKEUP_LP_IRQ interrupt request.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BLE_WAKEUP_REQ</name>
	<description>If 1, the BLE wakes up. Must be kept high at least for 1 low power clock period.
If the BLE is in deep sleep state, then by setting this bit it will cause the wake-up LP IRQ to be asserted with a delay of 3 to 4 low power cycles.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>GP_STATUS_REG</name>
	<description>General purpose system status register.</description>
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CAL_PHASE</name>
	<description>If 1, it designates that the chip is in Calibration Phase, that means the OTP has been initially programmed but no Calibration has occured. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>MEM_CTRL_REG</name>
	
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000164</resetValue>
	<resetMask>0x00001fff</resetMask>
	<fields><field>
	<name>ARB2_AHB2_WR_BUFF</name>
	
	<bitRange>[12:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ARB2_AHB_WR_BUFF</name>
	
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ARB1_AHB2_WR_BUFF</name>
	
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ARB1_AHB_WR_BUFF</name>
	
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ROM_EMA</name>
	
	<bitRange>[8:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ROM_KEN</name>
	
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM_EMAW</name>
	
