sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/config/toolbox_resources/DA1453x/common/DA14535.xml
	<registers>
	<register>
	<name>PATCH_ADDR0_REG</name>
	
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR10_REG</name>
	
	<addressOffset>0x00000070</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR11_REG</name>
	
	<addressOffset>0x00000078</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR12_REG</name>
	
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR13_REG</name>
	
	<addressOffset>0x00000088</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR14_REG</name>
	
	<addressOffset>0x00000090</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR15_REG</name>
	
	<addressOffset>0x00000098</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR16_REG</name>
	
	<addressOffset>0x000000a0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR17_REG</name>
	
	<addressOffset>0x000000a8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR18_REG</name>
	
	<addressOffset>0x000000b0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR19_REG</name>
	
	<addressOffset>0x000000b8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR1_REG</name>
	
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR20_REG</name>
	
	<addressOffset>0x000000c0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_D</name>
	
	<bitRange>[17:2]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR21_REG</name>
	
	<addressOffset>0x000000c8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_D</name>
	
