sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/config/toolbox_resources/DA1453x/common/DA14535.xml
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ADPLLDIG_LDO_ZERO_EN_RD</name>
	
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ADPLLDIG_LDO_EN_RD</name>
	
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RADIO_LDO_ZERO_EN_RD</name>
	
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RADIO_LDO_EN_RD</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_LDO_VREF_SEL_REG</name>
	
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields><field>
	<name>RF_LDO_DCO_VREF_SEL</name>
	
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_LDO_DTC_VREF_SEL</name>
	
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_LDO_RADIO_VREF_SEL</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_LNA_CTRL1_REG</name>
	
	<addressOffset>0x00000078</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x01084210</resetValue>
	<resetMask>0x01ffffff</resetMask>
	<fields><field>
	<name>LNA_TRIM_GAIN4_HP</name>
	
	<bitRange>[24:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_TRIM_GAIN3_HP</name>
	
	<bitRange>[19:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_TRIM_GAIN2_HP</name>
	
	<bitRange>[14:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_TRIM_GAIN1_HP</name>
	
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_TRIM_GAIN0_HP</name>
	
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_LNA_CTRL2_REG</name>
	
	<addressOffset>0x0000007c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00d6b5ad</resetValue>
	<resetMask>0x01ffffff</resetMask>
	<fields><field>
	<name>LNA_TRIM_GAIN4_LP</name>
	
	<bitRange>[24:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_TRIM_GAIN3_LP</name>
	
	<bitRange>[19:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_TRIM_GAIN2_LP</name>
	
	<bitRange>[14:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_TRIM_GAIN1_LP</name>
	
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_TRIM_GAIN0_LP</name>
	
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_LNA_CTRL3_REG</name>
	
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00111114</resetValue>
	<resetMask>0x0333333f</resetMask>
	<fields><field>
	<name>LNA_SPARE</name>
	
	<bitRange>[25:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_MODE_GAIN4_LP</name>
	
	<bitRange>[21:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_MODE_GAIN3_LP</name>
	
	<bitRange>[17:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_MODE_GAIN2_LP</name>
	
	<bitRange>[13:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_MODE_GAIN1_LP</name>
	
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_MODE_GAIN0_LP</name>
	
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_TRIM_CASC</name>
	
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_MIXER_CTRL1_REG</name>
	
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x010f010f</resetValue>
	<resetMask>0x03ff01ff</resetMask>
	<fields><field>
	<name>MIXER_IP2_DAC_EXTEND_RANGE</name>
	
	<bitRange>[25:25]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MIXER_IP2_DAC_Q_TRIM</name>
	
	<bitRange>[24:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MIXER_IP2_DAC_I_TRIM</name>
	
	<bitRange>[8:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_MIXER_CTRL2_REG</name>
	
	<addressOffset>0x00000068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00010f0f</resetMask>
	<fields><field>
	<name>MIX_CAL_SELECT</name>
	
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MIX_CAL_CAP_WR_2M</name>
	
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MIX_CAL_CAP_WR_1M</name>
	
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_OVERRULE_REG</name>
	
	<addressOffset>0x000000ac</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields><field>
	<name>RX_EN_OVR</name>
	
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TX_EN_OVR</name>
	
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_PA_CTRL_REG</name>
	
	<addressOffset>0x0000004c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000300</resetValue>
	<resetMask>0x0000033f</resetMask>
	<fields><field>
	<name>PA_RAMP_STEP_SPEED</name>
	
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TRIM_DUTY_NEG</name>
	
	<bitRange>[5:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TRIM_DUTY_POS</name>
	
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_RADIO_INIT_REG</name>
	
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x010303ff</resetMask>
	<fields><field>
	<name>RADIO_INIT_AUTOCLEAR</name>
	
	<bitRange>[24:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLLDIG_HCLK_DIS</name>
	
