sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/config/toolbox_resources/DA1453x/common/DA14535.xml
	<bitRange>[17:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RADIO_REGS_RDY</name>
	
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLLDIG_HCLK_EN</name>
	
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLLDIG_HRESET_N</name>
	
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLLDIG_LDO_EN_WR</name>
	
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLLDIG_LDO_EN_SEL</name>
	
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLLDIG_PWR_SW1_EN</name>
	
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RADIO_LDO_EN_WR</name>
	
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RADIO_LDO_EN_SEL</name>
	
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RADIO_LDO_EN</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_RFCU_CTRL_REG</name>
	
	<addressOffset>0x000000a8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>RF_RFCU_CLK_DIV</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_SCAN_FEEDBACK_REG</name>
	
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	
</register><register>
	<name>RF_SPARE_REG</name>
	
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x1fffffff</resetMask>
	<fields><field>
	<name>RF_SPARE_IN_EN</name>
	
	<bitRange>[28:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_SPARE_IN</name>
	
	<bitRange>[27:24]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RF_SPARE_BITS_HV</name>
	
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_SPARE_BITS</name>
	
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>RFCU_POWER</name>
	<version>1.0</version>
	<description>RFCU_POWER registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x40001200</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>400</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>RF_ALWAYS_EN1_REG</name>
	
	<addressOffset>0x00000180</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>ALW_EN_ADPLLDIG_EN</name>
	
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_ADPLLDIG_RST</name>
	
	<bitRange>[30:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_ADPLL_CLK_EN</name>
	
	<bitRange>[29:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_ADPLL_DCO_EN</name>
	
	<bitRange>[28:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_ADC_EN</name>
	
	<bitRange>[27:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_ADC_CLK_EN</name>
	
	<bitRange>[26:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_IFF_BIAS_SH_OPEN</name>
	
	<bitRange>[25:25]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_IFF_EN</name>
	
	<bitRange>[24:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_MIX_BIAS_SH_OPEN</name>
	
	<bitRange>[23:23]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_MIX_EN</name>
	
	<bitRange>[22:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_LNA_CGM_EN</name>
	
	<bitRange>[21:21]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_LNA_CORE_EN</name>
	
	<bitRange>[20:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_PA_EN</name>
	
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_PA_RAMP_EN</name>
	
	<bitRange>[18:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_RFIO_BIAS_SH_OPEN</name>
	
	<bitRange>[17:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_RFIO_BIAS_EN</name>
	
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_RFIO_TX_HARM_EN</name>
	
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_RFIO_TX_EN</name>
	
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_RFIO_RX_EN</name>
	
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_ADPLLDIG_LDO_LP</name>
	
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_ADPLLDIG_LDO_ACTIVERDY</name>
	
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_LNA_LDO_ZERO</name>
	
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_LDO_ZERO_EN</name>
	
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_ADPLL_DCO_LDO_EN</name>
	
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_ADPLL_DTC_LDO_EN</name>
	
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_ADPLL_TDC_LDO_EN</name>
	
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_IFFADC_LDO_EN</name>
	
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_IFF_LDO_EN</name>
	
