sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/config/toolbox_resources/DA1453x/common/DA14535.xml
	<addressOffset>0x0000005c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>MIX_BIAS_SH_OPEN_DCF_TX</name>
	
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MIX_BIAS_SH_OPEN_DCF_RX</name>
	
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG24_REG</name>
	
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>IFF_EN_DCF_TX</name>
	
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IFF_EN_DCF_RX</name>
	
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG25_REG</name>
	
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>IFF_BIAS_SH_OPEN_DCF_TX</name>
	
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IFF_BIAS_SH_OPEN_DCF_RX</name>
	
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG26_REG</name>
	
	<addressOffset>0x00000068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>ADC_CLK_EN_DCF_TX</name>
	
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADC_CLK_EN_DCF_RX</name>
	
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG27_REG</name>
	
	<addressOffset>0x0000006c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>ADC_EN_DCF_TX</name>
	
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADC_EN_DCF_RX</name>
	
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG28_REG</name>
	
	<addressOffset>0x00000070</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000041</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>ADPLL_DCO_EN_DCF_TX</name>
	
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLL_DCO_EN_DCF_RX</name>
	
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG29_REG</name>
	
	<addressOffset>0x00000074</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000041</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>ADPLL_CLK_EN_DCF_TX</name>
	
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLL_CLK_EN_DCF_RX</name>
	
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG2_REG</name>
	
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000003</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>LNA_LDO_EN_DCF_TX</name>
	
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_LDO_EN_DCF_RX</name>
	
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG30_REG</name>
	
	<addressOffset>0x00000078</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000107</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>ADPLLDIG_RST_DCF_TX</name>
	
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLLDIG_RST_DCF_RX</name>
	
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG31_REG</name>
	
	<addressOffset>0x0000007c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000149</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>ADPLLDIG_EN_DCF_TX</name>
	
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLLDIG_EN_DCF_RX</name>
	
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG32_REG</name>
	
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>ADPLLDIG_RX_EN_DCF_TX</name>
	
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLLDIG_RX_EN_DCF_RX</name>
	
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG33_REG</name>
	
	<addressOffset>0x00000084</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000001e0</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>ADPLLDIG_PAIN_EN_DCF_TX</name>
	
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLLDIG_PAIN_EN_DCF_RX</name>
	
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG34_REG</name>
	
	<addressOffset>0x00000088</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000001c0</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>ADPLL_LOBUF_PA_EN_DCF_TX</name>
	
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLL_LOBUF_PA_EN_DCF_RX</name>
	
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG35_REG</name>
	
	<addressOffset>0x0000008c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000294</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>CAL_EN_DCF_TX</name>
	
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CAL_EN_DCF_RX</name>
	
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG36_REG</name>
	
	<addressOffset>0x00000090</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000011</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>DEM_EN_DCF_TX</name>
	
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEM_EN_DCF_RX</name>
	
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG37_REG</name>
	
