sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/config/toolbox_resources/DA1453x/common/DA14535.xml
	<description>Hours tens. Represented in BCD digit (0-2).</description>
	<bitRange>[29:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RTC_TIME_HR_U</name>
	<description>Hours units. Represented in BCD digit (0-9).</description>
	<bitRange>[27:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RTC_TIME_M_T</name>
	<description>Minutes tens. Represented in BCD digit (0-5).</description>
	<bitRange>[22:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RTC_TIME_M_U</name>
	<description>Minutes units. Represented in BCD digit (0-9).</description>
	<bitRange>[19:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RTC_TIME_S_T</name>
	<description>Seconds tens. Represented in BCD digit (0-9).</description>
	<bitRange>[14:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RTC_TIME_S_U</name>
	<description>Seconds units. Represented in BCD digit (0-9).</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RTC_TIME_H_T</name>
	<description>Hundredths of a second tens. Represented in BCD digit (0-9).</description>
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RTC_TIME_H_U</name>
	<description>Hundredths of a second units. Represented in BCD digit (0-9).</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>SPI</name>
	<version>1.0</version>
	<description>SPI registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50001200</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>54</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>SPI_CLOCK_REG</name>
	<description>Spi clock register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>SPI_MASTER_CLK_MODE</name>
	<description>Should be always 1</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_CLK_DIV</name>
	<description>Applicable only in master mode
Defines the spi clock frequency in master only mode
SPI_CLK = module_clk / 2*(SPI_CLK_DIV+1) when SPI_CLK_DIV not 0x7F
if SPI_CLK_DIV=0x7F then SPI_CLK=module_clk</description>
	<bitRange>[6:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SPI_CONFIG_REG</name>
	<description>Spi control register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>SPI_SLAVE_EN</name>
	<description>0 = SPI module master mode
1 = SPI module slave mode</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_WORD_LENGTH</name>
	<description>Define the SPI word length = 1+ SPI_WORD_LENGTH (range 4 to 32)</description>
	<bitRange>[6:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_MODE</name>
	<description>Define the SPI mode (CPOL, CPHA)
0 = new data on falling, capture on rising, clk low in idle state
1 = new data on rising, capture on falling, Clk low in idle state
2 = new data on rising, capture on falling, Clk high in idle state
3 = new data on falling, capture on rising Clk high in idle state</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SPI_CS_CONFIG_REG</name>
	<description>Spi cs configuration register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields><field>
	<name>SPI_CS_SELECT</name>
	<description>Control the cs output in master mode
0 = none slave device selected
1 = selected slave device connected to GPIO with FUNC_MODE=SPI_CS0
2 = selected slave device connected to GPIO with FUNC_MODE=SPI_CS1
4 = selected slave device connected to GPIO with FUNC_MODE=GPIO</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SPI_CTRL_REG</name>
	<description>Spi control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>SPI_SWAP_BYTES</name>
	<description>0 = normal operation
1 = LSB and MSB are swaped in APB interface
In case of 8bit spi interface, DMA/SPI can be configured in 16bit mode to off load the bus. Enabling SPI_SWAP_BYTES bytes will read/wrte correctly</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_CAPTURE_AT_NEXT_EDGE</name>
	<description>0 = SPI captures data at correct clock edge
1 = SPI captures data at next clock edge. (only for Master mode and high clock)</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_FIFO_RESET</name>
	<description>0 = Fifo normal operation
1 = Fifo in reset state</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_DMA_RX_EN</name>
	<description>Applicable only when SPI_RX_EN = 1
0 = No DMA request for RX
1 = DMA request when SPI_STATUS_RX_FULL = 1</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_DMA_TX_EN</name>
	<description>Applicable only when SPI_TX_EN = 1
0 = No DMA request for TX
1 = DMA request when SPI_STATUS_TX_EMPTY = 1</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_RX_EN</name>
	<description>0 = RX path is disabled
1 = RX path is enabled
Note: if master clk async or spi mode=1 or spi mode=3 readonly is not supported</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_TX_EN</name>
	<description>0 = TX path is disabled
1 = TX path is enabled</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_EN</name>
	<description>0 = SPI module is disable
1 = SPI module is enable</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SPI_FIFO_CONFIG_REG</name>
	<description>Spi fifo configuration register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>SPI_RX_TL</name>
	<description>Receive FIFO threshold level in bytes. Control the level of bytes in fifo that triggers the RX_FULL interrupt. IRQ is occurred when fifo level is more or equal to SPI_RX_TL+1. Fifo level is from 0 to 4</description>
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_TX_TL</name>
	<description>Transmit FIFO threshold level in bytes. Control the level of bytes in fifo that triggers the TX_EMPTY interrupt. IRQ is occurred when fifo level is less or equal to SPI_TX_TL. Fifo level is from 0 to 4</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SPI_FIFO_HIGH_REG</name>
	<description>Spi TX/RX High 16bit word</description>
	<addressOffset>0x00000028</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SPI_FIFO_HIGH</name>
	<description>RX/TX fifo data. 16 MSb when spi word is larger than 16bits
This register has to be written before the SPI_FIFO_WRITE_REG
This register has to be read after the SPI_FIFO_READ_REG</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SPI_FIFO_READ_REG</name>
	<description>Spi RX fifo read register</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SPI_FIFO_READ</name>
	<description>Read from RX fifo. Read access is permit only if SPI_STATUS_RX_EMPTY=0. Returns the 16 LSb</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>SPI_FIFO_STATUS_REG</name>
	<description>SPI RX/TX fifo status register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00001000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SPI_TRANSACTION_ACTIVE</name>
	<description>In master mode
0 = spi transaction is inactive
1 = spi transaction is active</description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SPI_RX_FIFO_OVFL</name>
	<description>When 1, receive data is not written to fifo because fifo was full and interrupt is generated. It clears with SPI_CTRL_REG.SPI_FIFO_RESET</description>
	<bitRange>[14:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SPI_STATUS_TX_FULL</name>
	<description>0 = TX fifo is not full
1 = TX fifo is full</description>
	<bitRange>[13:13]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SPI_STATUS_RX_EMPTY</name>
	<description>0 = RX fifo is not empty
1 = RX fifo is empty</description>
	<bitRange>[12:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SPI_TX_FIFO_LEVEL</name>
	<description>Gives the number of bytes in TX fifo</description>
	<bitRange>[11:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SPI_RX_FIFO_LEVEL</name>
	<description>Gives the number of bytes in RX fifo</description>
	<bitRange>[5:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>SPI_FIFO_WRITE_REG</name>
	<description>Spi TX fifo wtite register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SPI_FIFO_WRITE</name>
	<description>Write to TX fifo. Write access is permit only if SPI_STATUS_TX_FULL is 0</description>
	<bitRange>[15:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>SPI_IRQ_MASK_REG</name>
	<description>Spi interrupt mask register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields><field>
	<name>SPI_IRQ_MASK_RX_FULL</name>
	<description>0 = FIFO RX full irq is masked
1 = FIFO RX full irq is enabled</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_IRQ_MASK_TX_EMPTY</name>
	<description>0 = FIFO TX empty irq is masked
1 = FIFO TX empy irq is enabled</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SPI_PAUSE_CTRL_REG</name>
	<description>SPI pause control register</description>
	<addressOffset>0x00000034</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00001fff</resetMask>
	<fields><field>
	<name>SPI_PAUSE_DATA_RDY_IS_MISO</name>
	<description>0 = data ready is the signal from the PPA
1 = data ready is the MISO signal</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_PAUSE_READY_ACTIVE_HIGH</name>
	<description>0 = ready input is active high (no gap is signal is low)
1 = ready input is active low (no gap is signal is high)</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_PAUSE_CLOCK_EN</name>
	<description>In case SPI_PAUSE_EN=1
Enable pause transcation based on programable delay (SPI_PAUSE_CLOCKS)
Note: Can be combined with SPI_PAUSE_DATA_READY_EN</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_PAUSE_DATA_READY_EN</name>
	<description>In case SPI_PAUSE_EN=1
Enable pause transcation based on external signal. Its polarity is defined by the SPI_PAUSE_READY_ACTIVE_HIGH
Note: Can be combined with SPI_PAUSE_CLOCK_EN</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_PAUSE_EN</name>
	<description>Pause transaction inserts gap between spi words (only in master mode and SPI_TX_EN=1).
0 = SPI pause transaction is disabled
1 = SPI pause transaction is enabled </description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_PAUSE_CLOCKS</name>
	<description>Defines the gap period in number of spi clock cycles minus one</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SPI_STATUS_REG</name>
	<description>Spi status register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields><field>
	<name>SPI_STATUS_RX_FULL</name>
	<description>Auto clear
0 = RX fifo level is less than SPI_RX_TL+1
1 = RX fifo level is more or equal to SPI_RX_TL+1</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SPI_STATUS_TX_EMPTY</name>
	<description>Auto clear
0 = TX fifo level is larger than SPI_TX_TL
1 = TX fifo level is less or equal to SPI_TX_TL</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>SPI_TXBUFFER_FORCE_H_REG</name>
	<description>SPI TX buffer force high value</description>
	<addressOffset>0x00000030</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SPI_TXBUFFER_FORCE_H</name>
	<description>Write directly the tx buffer (2 MSB). It must be used only in slave mode.
This register has to be written before the SPI_FIFO_WRITE_REG</description>
	<bitRange>[15:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>SPI_TXBUFFER_FORCE_L_REG</name>
	<description>SPI TX buffer force low value</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SPI_TXBUFFER_FORCE_L</name>
	<description>Write directly the tx buffer (2 LSB). It must be used only in slave mode</description>
	<bitRange>[15:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>SYS_WDOG</name>
	<version>1.0</version>
	<description>SYS_WDOG registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50003100</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>4</size>
	<usage>registers</usage>
</addressBlock>
	
