sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/config/toolbox_resources/DA1453x/common/DA14535.xml
	<registers>
	<register>
	<name>WATCHDOG_CTRL_REG</name>
	<description>Watchdog control register.</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>NMI_RST</name>
	<description>0 = Watchdog timer generates NMI at value 0, and WDOG (SYS) reset at &lt;=-16. Timer can be frozen /resumed using
SET_FREEZE_REG[FRZ_WDOG]/
RESET_FREEZE_REG[FRZ_WDOG].
1 = Watchdog timer generates a WDOG (SYS) reset at value 0 and can not be frozen by Software.
Note that this bit can only be set to 1 by SW and only be reset with a WDOG (SYS) reset or SW reset.
The watchdog is always frozen when the Cortex-M0 is halted in DEBUG State. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>WATCHDOG_REG</name>
	<description>Watchdog timer register.</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000000ff</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>WDOG_WEN</name>
	<description>0000.000 = Write enable for Watchdog timer
else Write disable. This filter prevents unintentional presetting the watchdog with a SW run-away. </description>
	<bitRange>[15:9]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>WDOG_VAL_NEG</name>
	<description>0 = Watchdog timer value is positive.
1 = Watchdog timer value is negative. </description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>WDOG_VAL</name>
	<description>Write: Watchdog timer reload value. Note that all bits 15-9 must be 0 to reload this register.
Read: Actual Watchdog timer value. Decremented by 1 every 10.24 msec. Bit 8 indicates a negative counter value. 2, 1, 0, 1FF16, 1FE16 etc. An NMI or WDOG (SYS) reset is generated under the following conditions:
If WATCHDOG_CTRL_REG[NMI_RST] = 0 then
    If WDOG_VAL = 0 -&gt; NMI (Non Maskable Interrupt)
    if WDOG_VAL = 1F016 -&gt; WDOG reset -&gt; reload FF16
If WATCHDOG_CTRL_REG[NMI_RST] = 1 then
    if WDOG_VAL &lt;= 0 -&gt; WDOG reset -&gt; reload FF16 </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>TIMER0</name>
	<version>1.0</version>
	<description>TIMER0 registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50003400</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>36</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>PWM2_END_CYCLE</name>
	<description>Defines end Cycle for PWM2</description>
	<addressOffset>0x00000016</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>END_CYCLE</name>
	<description>Defines the cycle in which the PWM becomes low. If end_cycle is larger then freq and start_cycle is not larger then freq, output is always 1</description>
	<bitRange>[13:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PWM2_START_CYCLE</name>
	<description>Defines start Cycle for PWM2</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>START_CYCLE</name>
	<description>Defines the cycle in which the PWM becomes high. if start_cycle is larger than freq or end_cycle is equal to start_cycle, pwm out is always 0</description>
	<bitRange>[13:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PWM3_END_CYCLE</name>
	<description>Defines end Cycle for PWM3</description>
	<addressOffset>0x00000018</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>END_CYCLE</name>
	<description>Defines the cycle in which the PWM becomes low. If end_cycle is larger then freq and start_cycle is not larger then freq, output is always 1</description>
	<bitRange>[13:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PWM3_START_CYCLE</name>
	<description>Defines start Cycle for PWM3</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>START_CYCLE</name>
	<description>Defines the cycle in which the PWM becomes high. if start_cycle is larger than freq or end_cycle is equal to start_cycle, pwm out is always 0</description>
	<bitRange>[13:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PWM4_END_CYCLE</name>
	<description>Defines end Cycle for PWM4</description>
	<addressOffset>0x0000001a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>END_CYCLE</name>
	<description>Defines the cycle in which the PWM becomes low. If end_cycle is larger then freq and start_cycle is not larger then freq, output is always 1</description>
	<bitRange>[13:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PWM4_START_CYCLE</name>
	<description>Defines start Cycle for PWM4</description>
	<addressOffset>0x0000000e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>START_CYCLE</name>
	<description>Defines the cycle in which the PWM becomes high. if start_cycle is larger than freq or end_cycle is equal to start_cycle, pwm out is always 0</description>
	<bitRange>[13:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PWM5_END_CYCLE</name>
	<description>Defines end Cycle for PWM5</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>END_CYCLE</name>
	<description>Defines the cycle in which the PWM becomes low. If end_cycle is larger then freq and start_cycle is not larger then freq, output is always 1</description>
	<bitRange>[13:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PWM5_START_CYCLE</name>
	<description>Defines start Cycle for PWM5</description>
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>START_CYCLE</name>
	<description>Defines the cycle in which the PWM becomes high. if start_cycle is larger than freq or end_cycle is equal to start_cycle, pwm out is always 0</description>
	<bitRange>[13:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PWM6_END_CYCLE</name>
	<description>Defines end Cycle for PWM6</description>
	<addressOffset>0x0000001e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>END_CYCLE</name>
	<description>Defines the cycle in which the PWM becomes low. If end_cycle is larger then freq and start_cycle is not larger then freq, output is always 1</description>
	<bitRange>[13:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PWM6_START_CYCLE</name>
	<description>Defines start Cycle for PWM6</description>
	<addressOffset>0x00000012</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>START_CYCLE</name>
	<description>Defines the cycle in which the PWM becomes high. if start_cycle is larger than freq or end_cycle is equal to start_cycle, pwm out is always 0</description>
	<bitRange>[13:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PWM7_END_CYCLE</name>
	<description>Defines end Cycle for PWM7</description>
	<addressOffset>0x00000020</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>END_CYCLE</name>
	<description>Defines the cycle in which the PWM becomes low. If end_cycle is larger then freq and start_cycle is not larger then freq, output is always 1</description>
	<bitRange>[13:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PWM7_START_CYCLE</name>
	<description>Defines start Cycle for PWM7</description>
	<addressOffset>0x00000014</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>START_CYCLE</name>
	<description>Defines the cycle in which the PWM becomes high. if start_cycle is larger than freq or end_cycle is equal to start_cycle, pwm out is always 0</description>
	<bitRange>[13:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>TIMER0_CTRL_REG</name>
	<description>Timer0 control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PWM_MODE</name>
	<description>0 = PWM signals are 1 during high time.
1 = PWM signals send out the (fast) clock divided by 2 during high time. So it will be in the range of 1 to 8 MHz. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIM0_CLK_DIV</name>
	<description>1 = Timer0 uses selected clock frequency as is.
0 = Timer0 uses selected clock frequency divided by 10.
Note that this applies only to the ON-counter.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIM0_CLK_SEL</name>
	<description>1 = Timer0 uses 16, 8, 4, or 2 MHz (fast) clock frequency
0 = Timer0 uses LP clock</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIM0_CTRL</name>
	<description>0 = Timer0 is off and in reset state
1 = Timer0 is running</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>TIMER0_ON_REG</name>
	<description>Timer0 on control register</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>TIM0_ON</name>
	<description>Timer0 On reload value:
If read the actual ON-counter value is returned </description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>TIMER0_RELOAD_M_REG</name>
	<description>16 bits reload value for Timer0</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>TIM0_M</name>
	<description>Timer0 &quot;high&quot; reload value
If read, the actual T0-counter value is returned </description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>TIMER0_RELOAD_N_REG</name>
	<description>16 bits reload value for Timer0</description>
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>TIM0_N</name>
	<description>Timer0 &quot;low&quot; reload value:
If read, the actual T0-counter value is returned </description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>TRIPLE_PWM_CTRL_REG</name>
	<description>PWM 2,3,4,5,6,7 Control</description>
	<addressOffset>0x00000022</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000004</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields><field>
	<name>TRIPLE_PWM_CLK_SEL</name>
	<description>1 = Timer2 uses 16, 8, 4, or 2 MHz (fast) clock frequency
0 = Timer2 uses LP clock</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>HW_PAUSE_EN</name>
	<description>1 = HW can pause PWM 2,3,4,5,6,7 </description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SW_PAUSE_EN</name>
	<description>1 = PWM 2 3 4 5 6 7 are paused </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TRIPLE_PWM_ENABLE</name>
	<description>1 = Enable PWM 2 3 4 5 6 7</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>TRIPLE_PWM_FREQUENCY</name>
	<description>Frequency for PWM 2,3,4,5,6 and 7</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>PWM_FREQ</name>
	<description>Defines the frequeancy of PWM 2,3,4,5,6 and 7. pwm freq = module Frequency/(value+1)
Module frequency is the LP_CLK when TRIPLE_PWM_CLK_SEL=0 else is the sys_clk divided by TMR_DIV</description>
	<bitRange>[13:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>TIMER1</name>
	<version>1.0</version>
	<description>TIMER1 registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50004000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>24</size>
	<usage>registers</usage>
</addressBlock>
	
