sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/config/toolbox_resources/DA1453x/common/DA14535.xml
	<registers>
	<register>
	<name>WKUP2_POL_GPIO_REG</name>
	<description>Select the sensitivity polarity for each P1 input</description>
	<addressOffset>0x0000000e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>WKUP2_POL_GPIO</name>
	<description>0 = the enabled input P0x increments the event2 counter if that input goes high
1 = the enabled input P0x increments the event2 counter if that input goes low</description>
	<bitRange>[11:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>WKUP2_SELECT_GPIO_REG</name>
	<description>Select which inputs from P1 port can trigger wkup counter</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>WKUP2_SELECT_GPIO</name>
	<description>0 = input P0x is not enabled for wakeup event counter
1 = input P0x is enabled for wakeup event counter</description>
	<bitRange>[11:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>WKUP_COMPARE_REG</name>
	<description>Number of events before wakeup interrupt</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>WKUP_COMPARE</name>
	<description>Defines the number of events -1 that have to be counted before the wakeup interrupt will be given. value 0 means one event.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>WKUP_COUNTER_REG</name>
	<description>Actual number of events of the wakeup counter</description>
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>EVENT2_VALUE</name>
	<description>This value represents the number of events that have been counted so far. It will be reset by writting to the WKUP_CNTR_RST bit field of the WKUP_IRQ_STATUS_REG </description>
	<bitRange>[15:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>EVENT_VALUE</name>
	<description>This value represents the number of events that have been counted so far. It will be reset by writting to the WKUP_CNTR_RST bit field of the WKUP_IRQ_STATUS_REG.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>WKUP_CTRL_REG</name>
	<description>Control register for the wakeup counter</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>ENABLE_125US_CLK</name>
	<description>0 = debounce unit time 1ms
1 = debounce unit time 125us</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>WKUP2_ENABLE_IRQ</name>
	<description>0 = no interrupt will be generated
1 = if the event counter2 reaches the value set by WKUP_COMPARE_REG an IRQ will be generated </description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>WKUP_ENABLE_IRQ</name>
	<description>0 = no interrupt will be generated
1 = if the event counter reaches the value set by WKUP_COMPARE_REG an IRQ will be generated </description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>WKUP_SFT_KEYHIT</name>
	<description>0 = no effect
1 = emulate key hit. The event counter and counter2 will increment by 1 (after debouncing if enabled). First make this bit 0 before any new key hit can be sensed. </description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>WKUP_DEB_VALUE</name>
	<description>Keyboard debounce time (N*1 ms with N = 1 to 63).
0x0: no debouncing
0x1 to 0x3F: 1 ms to 63 ms debounce time (when ENABLE_125US_CLK=0) else 125us to 7.875ms)</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>WKUP_IRQ_STATUS_REG</name>
	<description>Reset wakeup interrupt</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields><field>
	<name>WKUP2_CNTR_RST</name>
	<description>writing 1 will reset the event2 counter</description>
	<bitRange>[3:3]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>WKUP_CNTR_RST</name>
	<description>writing 1 will reset the event counter</description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>WKUP2_IRQ_STATUS</name>
	<description>Gives 1 when there is a wkup2 pending IRQ. Writing 1 will reset the interrupt. </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>WKUP_IRQ_STATUS</name>
	<description>Gives 1 when there is a wkup pending IRQ. Writing 1 will reset the interrupt. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>WKUP_POL_GPIO_REG</name>
	<description>Select the sensitivity polarity for each P0 input</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>WKUP_POL_GPIO</name>
	<description>0 = the enabled input P0x increments the event counter if that input goes high
1 = the enabled input P0x increments the event counter if that input goes low</description>
	<bitRange>[11:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>WKUP_SELECT_GPIO_REG</name>
	<description>Select which inputs from P0 port can trigger wkup counter</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>WKUP_SELECT_GPIO</name>
	<description>0 = input P0x is not enabled for wakeup event counter
1 = input P0x is enabled for wakeup event counter</description>
	<bitRange>[11:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral></peripherals>
</device>
